nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mk1024gpe064.h
PLIB_INLINE_API bool PLIB_ADCHS_ExistsAnalogInputScan(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsAnalogInputScan_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelAnalogFeatureEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelAnalogFeatureEnable_Default(index, channelID);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelAnalogFeatureDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelAnalogFeatureDisable_Default(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_ChannelIsReady(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_ChannelIsReady_Default(index, channelID);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelIsReadyInterruptEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelIsReadyInterruptEnable_Default(index, channelID);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelIsReadyInterruptDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelIsReadyInterruptDisable_Default(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsChannelAnalogControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsChannelAnalogControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelDigitalFeatureEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelDigitalFeatureEnable_pic32mk(index, channelID);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelDigitalFeatureDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelDigitalFeatureDisable_pic32mk(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsChannelDigitalControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsChannelDigitalControl_pic32mk(index);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputModeSelect(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput, ADCHS_INPUT_MODE mode)
{
     ADCHS_AnalogInputModeSelect_Default(index, analogInput, mode);
}

PLIB_INLINE_API ADCHS_INPUT_MODE PLIB_ADCHS_AnalogInputModeGet(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputModeGet_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsAnalogInputModeControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsAnalogInputModeControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputLevelTriggerSet(ADCHS_MODULE_ID index, ADCHS_CLASS12_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputLevelTriggerSet_Default(index, analogInput);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputEdgeTriggerSet(ADCHS_MODULE_ID index, ADCHS_CLASS12_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputEdgeTriggerSet_Default(index, analogInput);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputTriggerSourceSelect(ADCHS_MODULE_ID index, ADCHS_CLASS12_AN_INPUT_ID inputId, ADCHS_TRIGGER_SOURCE triggerSource)
{
     ADCHS_AnalogInputTriggerSourceSelect_Default(index, inputId, triggerSource);
}

PLIB_INLINE_API void PLIB_ADCHS_GlobalSoftwareTriggerEnable(ADCHS_MODULE_ID index)
{
     ADCHS_GlobalSoftwareTriggerEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_GlobalLevelSoftwareTriggerEnable(ADCHS_MODULE_ID index)
{
     ADCHS_GlobalLevelSoftwareTriggerEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_GlobalLevelSoftwareTriggerDisable(ADCHS_MODULE_ID index)
{
     ADCHS_GlobalLevelSoftwareTriggerDisable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_TriggerSuspendEnable(ADCHS_MODULE_ID index)
{
     ADCHS_TriggerSuspendEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_TriggerSuspendDisable(ADCHS_MODULE_ID index)
{
     ADCHS_TriggerSuspendDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsTriggerControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsTriggerControl_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ChannelTriggerSampleSelect(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID, ADCHS_CHANNEL_TRIGGER_SAMPLING_SEL sampSel)
{
     return ADCHS_ChannelTriggerSampleSelect_Default(index, channelID, sampSel);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsTriggerSampleControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsTriggerSampleControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_EarlyInterruptEnable(ADCHS_MODULE_ID index)
{
     ADCHS_EarlyInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_EarlyInterruptDisable(ADCHS_MODULE_ID index)
{
     ADCHS_EarlyInterruptDisable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputEarlyInterruptEnable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputEarlyInterruptEnable_Default(index, analogInput);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputEarlyInterruptDisable(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputEarlyInterruptDisable_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_AnalogInputEarlyInterruptIsReady(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputEarlyInterruptIsReady_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsEarlyInterruptControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsEarlyInterruptControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareSamplingStart(ADCHS_MODULE_ID index)
{
     ADCHS_SoftwareSamplingStart_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareSamplingStop(ADCHS_MODULE_ID index)
{
     ADCHS_SoftwareSamplingStop_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareConversionStart(ADCHS_MODULE_ID index)
{
     ADCHS_SoftwareConversionStart_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_SoftwareConversionInputSelect(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID anInput)
{
     ADCHS_SoftwareConversionInputSelect_Default(index, anInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsManualControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsManualControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_ControlRegistersCanBeUpdatedInterruptEnable(ADCHS_MODULE_ID index)
{
     ADCHS_ControlRegistersCanBeUpdatedInterruptEnable_Default(index);
}

